АлогистикТест2/src/Documents/алк_ВводНачальныхОстатков/алк_ВводНачальныхОстатков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>алк_ВводНачальныхОстатков</name>
  <registerRecords>AccumulationRegister.алк_ЗапасыОрганизации</registerRecords>
  <registerRecords>AccumulationRegister.алк_ОстаткиЗапасов</registerRecords>
  <registerRecords>AccumulationRegister.алк_ОстаткиЛесопродукции</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>СтруктурнаяЕдиница</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </attributes>
  <attributes>
    <name>Ячейка</name>
    <type>
      <types>CatalogRef.Ячейки</types>
      <types>CatalogRef.алк_Штабели</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидДокумента</name>
    <type>
      <types>EnumRef.алк_ВидыВводаОстатков</types>
    </type>
  </attributes>
  <attributes>
    <name>Расход</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСмены</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СменаУдалить</name>
    <type>
      <types>EnumRef.Смены</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Смена</name>
    <type>
      <types>CatalogRef.алк_Смены</types>
    </type>
  </attributes>
  <attributes>
    <name>Участок</name>
    <type>
      <types>CatalogRef.алк_Участки</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Запасы</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Объем</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сертификат</name>
      <type>
        <types>CatalogRef.СертификатыНаПродукцию</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

АлогистикТест2/src/Documents/алк_ВводНачальныхОстатков/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
	#Область ИнициализацияДаных
	
	
	// Инициализирует таблицы значений, содержащие данные табличных частей документа.
	// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
	//
	Процедура ИнициализироватьДанныеДокумента(ДокументСсылкаВводОстатков, СтруктураДополнительныеСвойства) Экспорт
		
		Запрос = Новый Запрос;
		Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	алк_ВводНачальныхОстатковЗапасы.Ссылка.Организация,
		|	алк_ВводНачальныхОстатковЗапасы.Ссылка.СтруктурнаяЕдиница,
		|	алк_ВводНачальныхОстатковЗапасы.Ссылка.Ячейка,
		|	алк_ВводНачальныхОстатковЗапасы.Номенклатура,
		|	алк_ВводНачальныхОстатковЗапасы.Характеристика,
		|	СУММА(алк_ВводНачальныхОстатковЗапасы.Количество) КАК Количество,
		|	СУММА(алк_ВводНачальныхОстатковЗапасы.Объем) КАК Объем,
		|	&ВидДвиженияНакопления КАК ВидДвижения,
		|	&Период,
		|	алк_ВводНачальныхОстатковЗапасы.Ссылка.ДатаСмены,
		|	алк_ВводНачальныхОстатковЗапасы.Ссылка.Смена,
		|	алк_ВводНачальныхОстатковЗапасы.Сертификат
		|ИЗ
		|	Документ.алк_ВводНачальныхОстатков.Запасы КАК алк_ВводНачальныхОстатковЗапасы
		|ГДЕ
		|	алк_ВводНачальныхОстатковЗапасы.Ссылка = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	алк_ВводНачальныхОстатковЗапасы.Характеристика,
		|	алк_ВводНачальныхОстатковЗапасы.Ссылка.ДатаСмены,
		|	алк_ВводНачальныхОстатковЗапасы.Ссылка.Организация,
		|	алк_ВводНачальныхОстатковЗапасы.Ссылка.СтруктурнаяЕдиница,
		|	алк_ВводНачальныхОстатковЗапасы.Сертификат,
		|	алк_ВводНачальныхОстатковЗапасы.Ссылка.Ячейка,
		|	алк_ВводНачальныхОстатковЗапасы.Ссылка.Смена,
		|	алк_ВводНачальныхОстатковЗапасы.Номенклатура
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	алк_ВводНачальныхОстатковЗапасы.Ссылка.Организация,
		|	алк_ВводНачальныхОстатковЗапасы.Ссылка.СтруктурнаяЕдиница,
		|	алк_ВводНачальныхОстатковЗапасы.Ссылка.Ячейка,
		|	алк_ВводНачальныхОстатковЗапасы.Номенклатура,
		|	алк_ВводНачальныхОстатковЗапасы.Характеристика,
		|	алк_ВводНачальныхОстатковЗапасы.Количество,
		|	алк_ВводНачальныхОстатковЗапасы.Объем,
		|	&ВидДвиженияНакопления КАК ВидДвижения,
		|	&Период,
		|	алк_ВводНачальныхОстатковЗапасы.Сертификат,
		|	алк_ВводНачальныхОстатковЗапасы.Ссылка.Ячейка КАК Штабель
		|ИЗ
		|	Документ.алк_ВводНачальныхОстатков.Запасы КАК алк_ВводНачальныхОстатковЗапасы
		|ГДЕ
		|	алк_ВводНачальныхОстатковЗапасы.Ссылка = &Ссылка";
		
		Запрос.УстановитьПараметр("ВидДвиженияНакопления", ?(ДокументСсылкаВводОстатков.Расход, ВидДвиженияНакопления.Расход, ВидДвиженияНакопления.Приход));
		Запрос.УстановитьПараметр("Период", РфпСервер.ПериодПроведения(ДокументСсылкаВводОстатков));
		Запрос.УстановитьПараметр("Ссылка", ДокументСсылкаВводОстатков);
		
		МассивРезультатов = Запрос.ВыполнитьПакет();
		
		СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаЗапасыОрганизации", МассивРезультатов[0].Выгрузить());
		СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаОстаткиЛесопродукции", МассивРезультатов[1].Выгрузить());
		
	КонецПроцедуры // ИнициализироватьДанныеДокумента()
	
	#КонецОбласти
	
#КонецЕсли
